[tasks]
bmc
cover

[options]
bmc: mode bmc
bmc: depth 80
cover: mode cover
cover: depth 200

[engines]
smtbmc z3

[script]
read_verilog -formal cdc_modules.v
read_verilog -formal fv_cdc_adc.v
prep -top fv_cdc_adc
clk2fflogic

[files]
../cdc_modules.v
fv_cdc_adc.v
